const MORSE_TABLE = {
    '.-':     'a',
    '-...':   'b',
    '-.-.':   'c',
    '-..':    'd',
    '.':      'e',
    '..-.':   'f',
    '--.':    'g',
    '....':   'h',
    '..':     'i',
    '.---':   'j',
    '-.-':    'k',
    '.-..':   'l',
    '--':     'm',
    '-.':     'n',
    '---':    'o',
    '.--.':   'p',
    '--.-':   'q',
    '.-.':    'r',
    '...':    's',
    '-':      't',
    '..-':    'u',
    '...-':   'v',
    '.--':    'w',
    '-..-':   'x',
    '-.--':   'y',
    '--..':   'z',
    '.----':  '1',
    '..---':  '2',
    '...--':  '3',
    '....-':  '4',
    '.....':  '5',
    '-....':  '6',
    '--...':  '7',
    '---..':  '8',
    '----.':  '9',
    '-----':  '0',
};

function decode(expr) {
    expr = expr.split(/(\d{10})/g)  // строка в массив из строк по 10 символов
               .join(' ')           // обратно в строку с пробелами
               .replace(/10/g, '.') // найти и заменить '10' на '.'
               .replace(/11/g, '-') // найти и заменить '11' на '-'
               .replace(/00/g, '')  // найти и заменить '00' на ''
               .replace(/\*{10}/g, '_')
               .split(' ')          // в массив из готовых символов
               .map(element => {
                   if (element == '_') return ' ';
                   for (let key in MORSE_TABLE) {
                       if (key == element) return MORSE_TABLE[key];
                   };
               })
               .join('')
    return expr;
}

module.exports = {
    decode
}